# Brewfile - Static configuration for secure development environment
# All tools are vetted for security and offline capability

# Core CLI tools
brew "git"
brew "jq"
brew "jc"
brew "tree"
brew "fzf"
brew "shfmt"

# Modern CLI replacements
brew "neovim"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "zoxide"

# Terminal tools
brew "zellij"

# Development tools
brew "pyenv"
brew "pipx"
brew "nvm"
brew "mise"

# Container & Infrastructure (user-directed network only)
brew "docker"
brew "kubectl"
brew "helm"
brew "terraform"
brew "terragrunt"

# Essential tools
brew "wget"
brew "htop"
