# Brewfile

# Fonts are now in homebrew/cask, no separate tap needed

# Core CLI
brew "git"
brew "git-delta"  # Beautiful git diffs
brew "gh"
brew "wget"
brew "htop"
brew "nvm"
brew "pyenv"
brew "pipx"
brew "sheldon"  # Fast Zsh plugin manager
brew "jq"        # JSON processor required by install.sh
brew "jc"        # Convert CLI output to JSON for automation
brew "tree"      # Directory structure visualization
brew "fzf"       # Fuzzy finder
brew "neovim"    # Modern Vim-based text editor
brew "ripgrep"   # Better grep
brew "bat"       # Better cat
brew "eza"       # Better ls
brew "fd"        # Better find
brew "zoxide"    # Smarter cd command
brew "zellij"    # Modern multiplexer
brew "lazygit"   # Terminal UI for Git operations
brew "dive"      # Docker image layer analysis
brew "kubectx"   # Fast Kubernetes context switching
brew "k9s"       # Kubernetes cluster management TUI
brew "stern"     # Multi-pod log tailing for Kubernetes
brew "krew"      # kubectl plugin manager
brew "kcat"      # Apache Kafka CLI (netcat for Kafka)
brew "tenv"      # Unified Terraform/OpenTofu version manager
brew "mise"      # Fast runtime version manager (replaces asdf)
brew "trivy"     # Security scanner for containers and IaC
brew "infracost" # Cost estimation for Terraform
brew "terraform-docs"  # Generate documentation for Terraform modules

# Note: Moved CLI tools back to Brewfile for reliable binary distribution
# Only shell plugins remain in package.json for Dependabot tracking